In [26]:
import pandas as pd
import pymysql

#### 连接到数据库取students表

In [27]:
conn = pymysql.connect(host="localhost",user="root",password="114514",db="test")
cursor = conn.cursor()

cursor.execute("select * from students where score=90;")
result = cursor.fetchall()

cursor.close()
conn.close()

print(result)

((1, 1, '小明', 'M', 90),)

注意看上边这个result，这个最后的逗号至关重要。它告诉了dataframe，(1, 1, '小明', 'M', 90)是一排而不是一列。

In [28]:

data2 = result

df2 = pd.DataFrame(data2,columns=["id","classID","name","gender","score"])

df2

   id  classID name gender  score
0   1        1   小明      M     90